app/controllers/api/v1/messages_controller.rb

  def index
    render json: ChatMessage.all
---
SELECT "chat_messages".* FROM "chat_messages"