app/controllers/api/v1/sessions_controller.rb

  def create
    user_password = params[:session][:password]
    user_email = params[:session][:email]
    user = user_email.present? && User.find_by(email: user_email)

    if user.valid_password? user_password
      sign_in user, store: false
      user.generate_authentication_token!
      user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "assaassaas@saasas.com"], ["LIMIT", 1]]
UPDATE "users" SET "current_sign_in_at" = $1, "last_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["current_sign_in_at", "2018-04-23 15:34:13.221200"], ["last_sign_in_at", "2018-04-23 15:33:49.004076"], ["sign_in_count", 3], ["updated_at", "2018-04-23 15:34:13.222093"], ["id", 2]]