app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)

    if user.password === user.password_confirmation
      email_exists = User.find_by(email: user.email)
      if !email_exists

          user.token = SecureRandom.hex(15)
          if user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "assaassaas@saasas.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def email_confirmation
    return render_api({ message: 'Email is already confirmed' }, 200) if user && user.confirmed
    return render_api({ message: 'You have confirmed your email' }, 200) if user && user.update_column(:confirmed, true)
---
UPDATE "users" SET "confirmed" = 't' WHERE "users"."id" = $1  [["id", 10]]