app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.password === user.password_confirmation

      email_exists = User.find_by(email: user.email)

      if !email_exists

        user.token = SecureRandom.hex(15)

          if user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "assasasa@assasa.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"